"""
    1. python 基于值的变量
"""
name1 = '你好'
name2 = '你好'
print('变量的地址：%d %d',id(name1),id(name2))
print("\n=================\n")

"""
    2. python 的输出方式
"""
# 2.1 %号模式
a1 = 18
a2 = 15.523
a3 = '你好呀就放假风'
a4 = '哈哈'
print("a1的值为：%d"%a1) #双引号”“ 加%
print("a1的值为：%d,a2的值为：%d"%(a1,a2)) #加%, 加括号\
# 2.2 format 格式
#format(输出项[,格式字符串]) , 其中格式字符串是可以选择项目
# {}内为输出内容格式 。format(变量集合)
# ''与format之间要加.即.format;   单个变量不用
print(format(a2,'.2f'))
print('{:.2f}'.format((a2))) #******    ‘’在左边的时候要加：
print('a1的值为：{},a2的值为：{:.2f},a3的值为：{}'.format(a1,a2,a3))
print('a3的值为：{0},a4的值为：{1}, {1},{0}'.format(a3,a4)) #字符串的映射

# print('a3的前三个值为：{0:2}'.format(a3))-------字符串的截取

# 2.3 f-string
# {变量名}
# 保留两位小数： {变量名: 保留格式}
# 字符串的截取： {str(变量名[])}切片
print(f'a1的值为{a1},a2的值为{a2:.2f},a3的值为{a3},a4的值为{str(a4[0])}')
print("\n=================\n")

# 2.4 混合输入
print("字符串加上数字：",a1,a2)

"""
    3. python 的输入方式
"""
#   3.1 是数字还是字符都将被作为字符串读取。如果想要接收数值，需要把接收到的字符串进行类型转换。例如，想要接收整型的数字并保存到变量num中
a1 = int(input('请输入数字'))
print(f'a1的值为：{a1}')
print('a1的值为{}'.format(a1))
print("a1的值为: %d"%a1)






















